Autodesk.Revit.DB.DecimalSymbol
Since:
2014
The symbol used to separate the integer and fractional parts of a number.
Since:
2014

Autodesk.Revit.DB.DecimalSymbol.Comma
A comma (",").

Autodesk.Revit.DB.DecimalSymbol.Dot
A dot (".").